// напишите программу, которая на вход
//принимает число и выдаёт его квадрат (Число умноженное на само себя)

Console.Write("Please add to value: ");
int n = Convert.ToInt32(Console.ReadLine());
Console.Write("Квадрат числа: ");
Console.Write(n);
Console.Write(" = ");
Console.Write(n * n);